#### IsSolidInView Method

---

|  |
| --- |
| RebarInSystem Class   See Also |

Checks if this rebar element is shown solidly in a 3D view.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The RebarInSystem will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")] public bool IsSolidInView( 	View3D view ) ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The RebarInSystem will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")> _ Public Function IsSolidInView ( _ 	view As View3D _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. The RebarInSystem will always be shown solidly in 3D views with Fine level of detail. To change this, you can override the detail level of view for Structural Rebar category.")] public: bool IsSolidInView( 	View3D^ view ) ``` |

#### Parameters

view
:   Type:  Autodesk.Revit.DB View3D
     The 3D view element

#### Return Value

True if rebar is shown solidly, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace